export default function MemberSection() {
  return (
    <section className="member-section">
      <div className="member-section__container container">
        <div className="member-section__header">
          <h1 className="member-section__heading">
            협회 회원이 되면 <br />
            누릴 수 있는 <span>혜택</span>
          </h1>
          <div className="member-section__content">
            <p>
              협회 회원이 되시면, 공정한 중재와 상담 서비스, 최신 관리 솔루션
              제공, 법적 안정성 확보, <br />
              업계 네트워킹 기회 등 다양한 혜택을 누리실 수 있습니다.
            </p>
            <p>
              협회 가입 후 관리비 절감 및 공실 관리 문제 해결로 <br />
              연간 수익이 개선된 실제 사례를 확인해보세요.
            </p>
          </div>
        </div>
        <div className="member-section__main">
          <div className="benefit">
            <h3 className="benefit__header">
              <span>
                <svg
                  width="27"
                  height="27"
                  viewBox="0 0 27 27"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M9.69355 14.044C9.69355 14.044 11.1213 15.6757 13.5008 15.6757C15.8804 15.6757 17.3081 14.044 17.3081 14.044M16.4923 8.60502H16.5032M10.5094 8.60502H10.5203M8.06185 20.0269V22.5674C8.06185 23.1471 8.06185 23.4369 8.18067 23.5857C8.28401 23.7152 8.4407 23.7905 8.60634 23.7903C8.7968 23.7901 9.02311 23.6091 9.47573 23.247L12.0706 21.1711C12.6007 20.747 12.8658 20.535 13.1609 20.3842C13.4227 20.2504 13.7015 20.1526 13.9895 20.0935C14.3142 20.0269 14.6536 20.0269 15.3324 20.0269H18.0696C19.8973 20.0269 20.8111 20.0269 21.5092 19.6712C22.1232 19.3583 22.6225 18.8591 22.9353 18.2451C23.291 17.547 23.291 16.6331 23.291 14.8055V8.93136C23.291 7.10369 23.291 6.18985 22.9353 5.49177C22.6225 4.87773 22.1232 4.37849 21.5092 4.06562C20.8111 3.70993 19.8973 3.70993 18.0696 3.70993H8.93209C7.10442 3.70993 6.19058 3.70993 5.49251 4.06562C4.87846 4.37849 4.37922 4.87773 4.06635 5.49177C3.71066 6.18985 3.71066 7.10369 3.71066 8.93136V15.6757C3.71066 16.6873 3.71066 17.1931 3.82186 17.6081C4.12362 18.7343 5.00326 19.6139 6.12943 19.9157C6.54442 20.0269 7.05023 20.0269 8.06185 20.0269ZM17.0362 8.60502C17.0362 8.90541 16.7927 9.14892 16.4923 9.14892C16.1919 9.14892 15.9484 8.90541 15.9484 8.60502C15.9484 8.30463 16.1919 8.06112 16.4923 8.06112C16.7927 8.06112 17.0362 8.30463 17.0362 8.60502ZM11.0533 8.60502C11.0533 8.90541 10.8098 9.14892 10.5094 9.14892C10.209 9.14892 9.9655 8.90541 9.9655 8.60502C9.9655 8.30463 10.209 8.06112 10.5094 8.06112C10.8098 8.06112 11.0533 8.30463 11.0533 8.60502Z"
                    stroke="currentColor"
                    stroke-width="1.15179"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                  />
                </svg>
              </span>
              전문 중재 및 상담 서비스
            </h3>
            <div className="benefit__body">
              <p>
                <span>중재와 분쟁 해결:</span> 전문가의 중재와 상담을 통해 건물
                관리에서 발생하는 분쟁을 효과적으로 해결하세요.
              </p>
              <p>
                <span>맞춤형 컨설팅:</span> 전문 컨설팅을 통해 관리 비용을
                절감하고, 효율적인 운영 방안을 제시해 드립니다.
              </p>
            </div>
          </div>
          <div className="benefit">
            <h3 className="benefit__header">
              <span>
                <svg
                  width="21"
                  height="24"
                  viewBox="0 0 21 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M18.8824 12.7353V6.36471C18.8824 4.48688 18.8824 3.54797 18.5169 2.83074C18.1954 2.19984 17.6825 1.68691 17.0516 1.36545C16.3344 1 15.3955 1 13.5176 1H6.36471C4.48688 1 3.54797 1 2.83074 1.36545C2.19984 1.68691 1.68691 2.19984 1.36545 2.83074C1 3.54797 1 4.48688 1 6.36471V17.9882C1 19.8661 1 20.805 1.36545 21.5222C1.68691 22.1531 2.19984 22.666 2.83074 22.9875C3.54797 23.3529 4.48688 23.3529 6.36471 23.3529H9.94118M12.1765 11.0588H5.47059M7.70588 15.5294H5.47059M14.4118 6.58823H5.47059M12.7353 20L14.9706 22.2353L20 17.2059"
                    stroke="currentColor"
                    stroke-width="1.18339"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                  />
                </svg>
              </span>
              최적화된 관리 솔루션
            </h3>
            <div className="benefit__body">
              <p>
                <span>관리 절감 솔루션:</span> 최신 관리 도구를 활용하여 건물
                관리 비용을 절감하고, 운영 효율성을 극대화합니다.
              </p>
              <p>
                <span>사례 연구 제공:</span> 성공적인 관리 사례를 통해, 비용
                절감과 효율적인 운영 방안을 확인하고 적용해 보세요.
              </p>
            </div>
          </div>
          <div className="benefit">
            <h3 className="benefit__header">
              <span>
                <svg
                  width="19"
                  height="24"
                  viewBox="0 0 19 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.20184 11.4834L8.40065 13.7063L13.348 8.70471M18.2953 12.0391C18.2953 17.4947 12.4091 21.4626 10.2674 22.7258C10.024 22.8693 9.90233 22.9411 9.73057 22.9783C9.59728 23.0072 9.40282 23.0072 9.26953 22.9783C9.09778 22.9411 8.97608 22.8693 8.73268 22.7258C6.59099 21.4626 0.704834 17.4947 0.704834 12.0391V6.72362C0.704834 5.83499 0.704834 5.39067 0.848592 5.00874C0.975589 4.67134 1.18196 4.37028 1.44985 4.1316C1.75311 3.86141 2.16462 3.7054 2.98764 3.39338L8.88241 1.15858C9.11097 1.07193 9.22525 1.0286 9.34282 1.01143C9.4471 0.996191 9.553 0.996191 9.65728 1.01143C9.77485 1.0286 9.88913 1.07193 10.1177 1.15858L16.0125 3.39338C16.8355 3.7054 17.247 3.86141 17.5502 4.1316C17.8181 4.37028 18.0245 4.67134 18.1515 5.00874C18.2953 5.39067 18.2953 5.83499 18.2953 6.72362V12.0391Z"
                    stroke="currentColor"
                    stroke-width="1.17685"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                  />
                </svg>
              </span>
              법적 보호 및 산업 네트워킹
            </h3>
            <div className="benefit__body">
              <p>
                <span>법적 안정성 확보:</span> 법적 분쟁 및 이슈를 예방하고
                해결하기 위해, 전문가의 법률 자문을 제공합니다.
              </p>
              <p>
                <span>협회 네트워킹 혜택:</span> 회원 간의 네트워킹을 통해, 산업
                내에서 입지를 강화하고, 새로운 협력 기회를 발굴해 보세요.
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}
